# CETM50 -  Technology Management For Organisations
## Name: AKINWUMI ISAAC KAYODE

## Student ID: bi54up

In [1]:
import csv
import json
import xml.etree.ElementTree as ET

## Function to parse CSV data, merge JSON data, merge XML data, read text file

In [2]:
def parse_csv_data(file_path):
    """
    Parses CSV data and returns a dictionary.

    :param file_path: Path to the CSV file.
    :return: Dictionary containing parsed CSV data.
    """
    parsed_data = {}
    with open(file_path, newline='') as csvfile:
        csv_reader = csv.DictReader(csvfile)
        for row in csv_reader:
            full_name = row['First Name'] + ' ' + row['Second Name']
            parsed_data[full_name] = row
    return parsed_data

In [3]:
def merge_json_data(file_path, csv_data):
    """
    Merges JSON data with existing CSV data.

    :param file_path: Path to the JSON file.
    :param csv_data: Existing CSV data dictionary.
    """
    with open(file_path) as jsonfile:
        json_data = json.load(jsonfile)
        for record in json_data:
            full_name = record['firstName'] + ' ' + record['lastName']
            # Handle 'debt' field
            if 'debt' in record and isinstance(record['debt'], dict):
                debt_info = record['debt']
                dept_amount = debt_info.get('amount', 0)
                dept_time_period_years = debt_info.get('time_period_years', 0)
                del record['debt']
            else:
                dept_amount = 0
                dept_time_period_years = 0
            record['dept_amount'] = dept_amount
            record['dept_time_period_years'] = dept_time_period_years
            csv_data.setdefault(full_name, {}).update(record)

In [4]:
def merge_xml_data(file_path, csv_data):
    """
    Merges XML data with existing CSV data.

    :param file_path: Path to the XML file.
    :param csv_data: Existing CSV data dictionary.
    """
    xml_data = ET.parse(file_path).getroot()
    for user in xml_data.findall('user'):
        full_name = f"{user.attrib['firstName']} {user.attrib['lastName']}"
        record = {attr: user.attrib[attr] for attr in user.attrib}
        csv_data.setdefault(full_name, {}).update(record)

In [5]:
def read_text_file(file_path):
    """
    Reads a text file line by line and returns the data in a list.

    :param file_path: Path to the text file.
    :return: List containing each line of the text file.
    """
    data = []
    with open(file_path, mode='r', encoding='utf-8') as file:
        data = file.readlines()
    return data

In [17]:
# Read text file
txt_data = read_text_file('cetm50_23_4_data/user_data_23_4.txt')
for i in range(0, 4):
    print(txt_data[i])

# Parse CSV data
csv_data = parse_csv_data('cetm50_23_4_data/user_data_23_4.csv')

# Merge JSON data
merge_json_data('cetm50_23_4_data/user_data_23_4.json', csv_data)

# Merge XML data
merge_xml_data('cetm50_23_4_data/user_data_23_4.xml', csv_data)

"Valerie Ellis e-mailed in overnight (Full details in Ticket #1839). During account creation something went wrong and their security code is wrong on their billing information. Bank is rejecting any payment until it's corrected. They're not sure what happened, but said to try "762". Can you please action this and try re-bill the client? Let me know if there's any further issues with it. Thanks"

"Congratulations on the promotion West! We wouldn't have survived through the pandemic without you and your team. As a token of our appreciation, we've given you a £2100 salary bump. This will take effect as of next month's payroll. At Williams-Wheeler we value the care and work you put in. See you on Monday Charlie, enjoy!"

"Happy Birthday Mr Charlie Short! You're 52 today. Our latest offers will be sure to get you into the party spirit!"

"Hannah, the pension policy has changed slightly since the meeting last week. I know you've just finished putting through all the changes, but I need you to look at Mr Martin's file. We'll need to  modify it by adding another 0.15% on top of the existing £22896. Drop me a message when you've done this please, it's quite urgent."

In [18]:

# Convert merged dictionary into a unified dataset format
unified_data = list(csv_data.values())

# Define updates based on conditions
updates = {
    ('Valerie', 'Ellis'): {'credit_card_security_code': 762},
    ('Charlie', 'West'): {'salary': 2100, 'age': 52},
    ('Martin', None): {'pension': lambda x: 0.0015 * int(x) + int(x)}  # lambda function for dynamic update
}

# Apply updates
for record in unified_data:
    for (first_name, last_name), update_fields in updates.items():
        if record.get('firstName') == first_name and record.get('lastName') == last_name:
            for field, value in update_fields.items():
                if callable(value):
                    record[field] = value(record.get(field, 0))
                else:
                    record[field] = value
            print(f"{', '.join(update_fields.keys())} Updated")

# Drop specified columns from each record
columns_to_drop = ['First Name', 'Second Name', 'Age (Years)', 'Sex', 'Vehicle Make', 'Vehicle Model', 'Vehicle Year', 'Vehicle Type', 'debt']
for record in unified_data:
    record['Vehicle_Make'] = record['Vehicle Make']
    record['Vehicle_Model'] = record['Vehicle Model']
    record['Vehicle_Year'] = record['Vehicle Year']
    record['Vehicle_Type'] = record['Vehicle Type']
    for column in columns_to_drop:
        record.pop(column, None)

# Write unified data to JSON
with open('customer_unified_data.json', 'w') as jsonfile:
    json.dump(unified_data, jsonfile, indent=4)

salary, age Updated
credit_card_security_code Updated

In [23]:
#unified_data

In [8]:
# ! pip install pony pymysql

In [21]:
from pony.orm import *

# Database configuration
host = 'europa.ashley.work'
user_and_database = 'student_bi54up'
password = 'iE93F2@8EhM@1zhD&u9M@K'

# Set up Pony ORM database
db = Database()

# Bind the database with MySQL
db.bind(provider='mysql', host=host,
        user=user_and_database,
        passwd=password,
        database=user_and_database)

# Enable SQL debug mode
sql_debug(True)

# db.drop_table("customerentity", with_all_data=True, if_exists=True)
########################################################################
class CustomerEntity(db.Entity):
    """
    Pony ORM model of records table
    """
    id = PrimaryKey(int, auto=True)
    firstName = Required(str)
    lastName = Required(str)
    age = Required(int)
    sex = Required(str)
    address_main = Required(str)
    address_city = Required(str)
    Vehicle_Make = Required(str)
    Vehicle_Model = Required(str)
    Vehicle_Year = Required(int)
    Vehicle_Type = Required(str)
    retired = Optional(bool)
    credit_card_number = Required(str)
    credit_card_security_code = Required(int)
    credit_card_start_date = Required(str)
    credit_card_end_date = Required(str)
    dept_amount = Optional(float)
    dept_time_period_years = Optional(float)
    dependants = Optional(str)
    marital_status = Required(str)
    salary = Required(int)
    pension = Optional(float)
    company = Optional(str)
    commute_distance = Optional(float)
    address_postcode = Optional(str)
    iban = Optional(str)

db.generate_mapping(create_tables=True) 
sql_debug(True)


def push_data(db_class, data):
  """
    Uploads data to the specified database table.

    :param db_class: Pony ORM entity class representing the database table.
    :param data: List of dictionaries representing the data to be uploaded.
  """
  try:
    for entry in data:
        db_class(**entry)
    commit()
    print('Entries Added Successfully')
  except Exception as e:
        print(f"An error occurred while uploading data to the database: {e}")

GET NEW CONNECTION
RELEASE CONNECTION
GET CONNECTION FROM THE LOCAL POOL
SET foreign_key_checks = 0
CREATE TABLE `customerentity` (
  `id` INTEGER PRIMARY KEY AUTO_INCREMENT,
  `firstname` VARCHAR(255) NOT NULL,
  `lastname` VARCHAR(255) NOT NULL,
  `age` INTEGER NOT NULL,
  `sex` VARCHAR(255) NOT NULL,
  `address_main` VARCHAR(255) NOT NULL,
  `address_city` VARCHAR(255) NOT NULL,
  `vehicle_make` VARCHAR(255) NOT NULL,
  `vehicle_model` VARCHAR(255) NOT NULL,
  `vehicle_year` INTEGER NOT NULL,
  `vehicle_type` VARCHAR(255) NOT NULL,
  `retired` BOOLEAN,
  `credit_card_number` VARCHAR(255) NOT NULL,
  `credit_card_security_code` INTEGER NOT NULL,
  `credit_card_start_date` VARCHAR(255) NOT NULL,
  `credit_card_end_date` VARCHAR(255) NOT NULL,
  `dept_amount` DOUBLE,
  `dept_time_period_years` DOUBLE,
  `dependants` VARCHAR(255) NOT NULL,
  `marital_status` VARCHAR(255) NOT NULL,
  `salary` INTEGER NOT NULL,
  `pension` DOUBLE,
  `company` VARCHAR(255) NOT NULL,
  `commute_distance` DOUBLE,
  `address_postcode` VARCHAR(255) NOT NULL,
  `iban` VARCHAR(255) NOT NULL
)

SELECT `customerentity`.`id`, `customerentity`.`firstname`, `customerentity`.`lastname`, `customerentity`.`age`, `customerentity`.`sex`, `customerentity`.`address_main`, `customerentity`.`address_city`, `customerentity`.`vehicle_make`, `customerentity`.`vehicle_model`, `customerentity`.`vehicle_year`, `customerentity`.`vehicle_type`, `customerentity`.`retired`, `customerentity`.`credit_card_number`, `customerentity`.`credit_card_security_code`, `customerentity`.`credit_card_start_date`, `customerentity`.`credit_card_end_date`, `customerentity`.`dept_amount`, `customerentity`.`dept_time_period_years`, `customerentity`.`dependants`, `customerentity`.`marital_status`, `customerentity`.`salary`, `customerentity`.`pension`, `customerentity`.`company`, `customerentity`.`commute_distance`, `customerentity`.`address_postcode`, `customerentity`.`iban`
FROM `customerentity` `customerentity`
WHERE 0 = 1

COMMIT
SET foreign_key_checks = 1
CLOSE CONNECTION

In [22]:
push_data(CustomerEntity, unified_data)

GET NEW CONNECTION
INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Leon', 'Smith', 48, 'Male', '0 Shaw plains', "O'Neillshire", 'Mercedes-Benz', 'Astro Cargo', 2009, 'Pickup', True, '2292406027303835', 750, '09/18', '01/22', 0.0, 0.0, '2', 'married or civil partner', 65911, 0.0, 'Gilbert, Williams and Quinn', 15.68, 'DY0 3SG', 'GB05DRJP98363742599825']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Margaret', 'Mason', 35, 'Female', 'Studio 8 Craig stravenue', 'West Stephanie', 'Honda', 'Sable', 2015, 'Van/Minivan', True, '30231894919500', 460, '05/23', '01/27', 0.0, 0.0, '1', 'married or civil partner', 19095, 0.0, 'Gibson PLC', 6.13, 'WR2H 3NN', 'GB60KAOM78304632971837']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Guy', 'Harrison', 26, 'Male', '694 Allan underpass', 'West Lucyshire', 'Chevrolet', 'S60', 2013, 'SUV', True, '4470811972956349', 201, '10/17', '06/25', 0.0, 0.0, '4', 'single', 22704, 0.0, 'Collins, Wade and Parker', 7.14, 'WR4M 2LP', 'GB95ASFR17716818519894']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Denise', 'Robinson', 30, 'Female', 'Studio 3 Zoe plain', 'Lake Leighside', 'Ford', 'Tucson', 2002, 'Sedan', True, '6538381451448304', 787, '06/21', '02/23', 0.0, 0.0, '2', 'single', 93818, 0.0, 'Higgins-Wallis', 19.68, 'E17 1TN', 'GB04BDET54533760891177']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Simon', 'Fox', 27, 'Male', '3 Farrell landing', 'East Nathanhaven', 'Toyota', 'Dart', 2005, 'SUV', True, '345302782495497', 320, '03/17', '04/32', 0.0, 0.0, '', 'married or civil partner', 46300, 0.0, 'Carey-Owens', 12.34, 'CT99 0XU', 'GB03NSDY21514645285507']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Tom', 'Cooke', 69, 'Male', 'Flat 85 Francesca club', 'Donaldton', 'Hyundai', 'Liberty', 2019, 'Pickup', True, '4508482106453342', 995, '12/19', '10/22', 0.0, 0.0, '2', 'single', 78099, 0.0, 'Parker PLC', 17.52, 'G28 1EQ', 'GB76CPZH28462200647918']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Fiona', 'Marshall', 86, 'Female', 'Flat 03k Zoe mountains', 'Mosstown', 'Chevrolet', 'Pathfinder', 2006, 'SUV', True, '4424742584764', 296, '01/19', '05/29', 0.0, 0.0, '2', 'married or civil partner', 27329, 29558.0, 'N/A', 0.0, 'B3 9ZN', 'GB49BDWW43070364283733']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Mitchell', 'Davidson', 84, 'Male', "667 O'Brien land", 'Jonesbury', 'Subaru', 'A8', 2006, 'Sedan, Hatchback, Wagon', True, '676251959745', 376, '10/22', '04/29', 0.0, 0.0, '1', 'married or civil partner', 72088, 28111.0, 'N/A', 0.0, 'NP3 5ZP', 'GB24SZKG28634206052106']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Sam', 'Long', 83, 'Male', '4 Vincent drive', 'Stewartton', 'Mercedes-Benz', 'Azure T', 2018, 'Coupe', True, '2245031471396677', 6, '05/19', '02/26', 0.0, 0.0, '2', 'single', 58511, 26792.0, 'N/A', 0.0, 'NP5 2SJ', 'GB16OLBW26880983186148']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Sean', 'Perry', 87, 'Male', '54 Victor walks', 'Lake Roy', 'Ford', '1500 Regular Cab', 2010, 'SUV', True, '3571761306387507', 5454, '01/23', '02/25', 0.0, 0.0, '2', 'married or civil partner', 72515, 32420.0, 'N/A', 0.0, 'EX27 3XW', 'GB24TVGV89818186516727']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Jacob', 'Bennett', 66, 'Male', '0 Barnes club', 'New Jennachester', 'Mercedes-Benz', 'Impreza', 1999, 'SUV', True, '4993777051811200', 244, '03/19', '04/20', 0.0, 0.0, '1', 'single', 92862, 0.0, 'Smith, Osborne and Hammond', 19.55, 'DN5R 9DX', 'GB37OBOT69175746358471']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Lydia', 'Henderson', 62, 'Female', 'Flat 4 Dominic courts', 'Port Joshview', 'Nissan', 'GLC Coupe', 2006, 'SUV', True, '3512212241942610', 492, '12/18', '03/23', 0.0, 0.0, '1', 'divorced', 90083, 0.0, 'Akhtar, Jones and Morris', 19.18, 'B55 5BB', 'GB49YWRF00584915087635']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Nathan', 'Slater', 81, 'Male', 'Flat 71U Elizabeth mission', 'Ritafurt', 'Cadillac', 'RLX', 1992, 'Sedan', True, '3577861995095736', 939, '10/20', '06/29', 0.0, 0.0, '2', 'divorced', 56794, 28402.0, 'N/A', 0.0, 'S74 4AJ', 'GB07LTNZ30627642850580']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Claire', 'Russell', 41, 'Female', 'Studio 1 Williams springs', 'Port Jack', 'Mercedes-Benz', 'Voyager', 1992, 'Van/Minivan', True, '2288206984756595', 918, '02/19', '11/31', 0.0, 0.0, '2', 'married or civil partner', 51199, 0.0, 'Yates Inc', 13.23, 'M54 6EA', 'GB84JZQA63843285464433']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Katy', 'Green', 78, 'Female', '939 Gould well', 'South Scott', 'Volvo', 'Galant', 1992, 'Wagon', True, '213187531453197', 8990, '12/14', '12/33', 0.0, 0.0, '2', 'married or civil partner', 47424, 0.0, 'James, Richardson and Cooke', 12.54, 'S3 6HS', 'GB83MMRZ64018472597921']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Duncan', 'Moore', 67, 'Male', '5 Lydia parks', 'Lesleymouth', 'Volkswagen', 'SLK-Class', 1997, 'Sedan', True, '2705462381301924', 274, '06/16', '11/29', 0.0, 0.0, '2', 'married or civil partner', 67814, 0.0, 'Griffiths Group', 15.98, 'E87 9TP', 'GB35IJYJ72719118013461']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Abbie', 'Miller', 73, 'Female', 'Studio 61 Kayleigh drive', 'Lake Victoriaville', 'Dodge', 'del Sol', 2002, 'Sedan', True, '503870401257', 653, '07/15', '08/27', 0.0, 0.0, '2', 'single', 38800, 0.0, 'Lewis-Gibbons', 10.87, 'LS0M 9LG', 'GB20NEGF61781527471339']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Amber', 'Hobbs', 21, 'Female', 'Flat 14n Emily passage', 'Clareland', 'Toyota', 'Rodeo', 1999, 'Van/Minivan', True, '4108286226488071625', 254, '12/17', '11/26', 0.0, 0.0, '2', 'married or civil partner', 26372, 0.0, 'Andrews, Collins and Fraser', 8.08, 'SS66 4AX', 'GB56QXRS20758368749724']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Samuel', 'Daniels', 47, 'Male', 'Flat 1 Taylor ramp', 'Lake Eileen', 'Volvo', 'Clarity Electric', 2016, 'SUV', True, '676170955675', 210, '07/18', '04/24', 0.0, 0.0, '2', 'married or civil partner', 56218, 0.0, 'Hughes Group', 14.1, 'FK92 5YA', 'GB69EDMQ96008466449188']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Louise', 'Parry', 66, 'Female', 'Flat 7 Amelia plaza', 'New Michellebury', 'Ford', 'Ram 1500 Quad Cab', 2003, 'Sedan, Coupe', True, '568711564332', 160, '11/19', '07/20', 0.0, 0.0, '1', 'married or civil partner', 53080, 0.0, 'Willis LLC', 13.56, 'N75 6YP', 'GB41NNRI52449172646036']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['June', 'Macdonald', 67, 'Female', 'Studio 92s Kim light', 'New Martyn', 'Cadillac', 'Camaro', 2016, 'Sedan, Hatchback', True, '346398133417692', 777, '05/15', '12/20', 0.0, 0.0, '2', 'single', 90360, 0.0, 'Allen, Gill and Lewis', 19.22, 'E40 3ZS', 'GB80ZPSW88048103878430']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Eileen', 'Lee', 55, 'Female', 'Flat 3 Martin greens', 'New Georgina', 'Volkswagen', 'Grand Cherokee', 2015, 'Sedan', True, '3542537199382227', 639, '07/18', '04/33', 0.0, 0.0, '2', 'married or civil partner', 25370, 0.0, 'Gregory, Martin and Thompson', 7.83, 'W3 5NS', 'GB44CJCO44546702771777']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Sian', 'Mason', 72, 'Female', '981 Lindsey cove', 'North Maureen', 'Toyota', 'Armada', 1993, 'Hatchback, Convertible', True, '213197134449039', 945, '02/19', '06/20', 0.0, 0.0, '1', 'single', 94647, 0.0, 'Savage Group', 19.79, 'E35 9FB', 'GB76POLE49461500631985']

INSERT INTO `customerentity` (`firstname`, `lastname`, `age`, `sex`, `address_main`, `address_city`, `vehicle_make`, `vehicle_model`, `vehicle_year`, `vehicle_type`, `retired`, `credit_card_number`, `credit_card_security_code`, `credit_card_start_date`, `credit_card_end_date`, `dept_amount`, `dept_time_period_years`, `dependants`, `marital_status`, `salary`, `pension`, `company`, `commute_distance`, `address_postcode`, `iban`) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
['Brett', 'Mason', 89, 'Male', 'Studio 72 Harding throughway', 'West Melanieport', 'Mercedes-Benz', 'Neon', 2010, 'Sedan', True, '4463563861248374', 517, '01/15', '02/15', 0.0, 0.0, '2', 'single', 40299, 14849.0, 'N/A', 0.0, 'N51 3NY', 'GB67IITC61448014947824']
